ams/src/DataProcessors/AMS_ПодборТоваров/AMS_ПодборТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_ПодборТоваров</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныДокумент</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныСоглашение</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнеПрайса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПродукции</name>
      <type>
        <types>CatalogRef.AMS_Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокКлиента</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокНаш</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прайс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидкиАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПродукции</name>
      <type>
        <types>CatalogRef.AMS_Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварКлиента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>EnumRef.AMS_ТоварныйЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Факт1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагСкидка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагСкидкаАкция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДокумент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоглашение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/Catalogs/AMS_Продукция/AMS_Продукция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_Продукция</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Маркер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>EnumRef.AMS_ТоварныйЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прайс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>В2В</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧестныйЗнак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КфцРРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/DataProcessors/AMS_ПодборТоваров/Forms/ФормаЗагрузкиИзБланкаЗаказа/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("КодТовара", Новый ОписаниеТипов("Строка"));
	Табл.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));

	МассивСтрок = Параметры.МассивСтрок;
	
	Если МассивСтрок = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из МассивСтрок Цикл
		НовСтр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла;
	
	Партнер = Параметры.Партнер;
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Родитель");
	Партнер = ?(ЗначениеЗаполнено(Родитель), Родитель, Партнер); 
	
	СопоставитьДанныеПоКод(Табл);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Стр = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
	
	Стр.КоличествоУпаковок = Стр.Количество / Кфц;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	Стр = Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
	
	Стр.Количество = Стр.КоличествоУпаковок * Кфц;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТовары(Команда)
	ОчиститьСообщения(); 
	
	МассивСтрок = ПолучитьНайденныеТовары();
	
	Если Не МассивСтрок = Неопределено Тогда
		Закрыть(МассивСтрок);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СопоставитьДанныеПоКод(Табл)
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары",  Табл);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(т.КодТовара КАК СТРОКА(500)) КАК ЗагружаемыйТовар,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тов.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	Прод.Номенклатура КАК Номенклатура,
	|	Тов.Количество * Ном.КоэффициентЕдиницыДляОтчетов КАК Количество,
	|	Тов.Количество КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Тов КАК Тов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК Прод
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|			ПО Прод.Номенклатура = Ном.Ссылка
	|		ПО Тов.ЗагружаемыйТовар = Прод.Номенклатура.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	НомКонтр.Код КАК КодКлиента,
	|	НомКонтр.Артикул КАК АртикулКлиента,
	|	НомКонтр.НаименованиеНоменклатуры КАК НоменклатураКлиента
	|ПОМЕСТИТЬ НомКонт
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НомКонтр
	|		ПО (&Партнер = НомКонтр.Владелец)
	|			И вт.Номенклатура = НомКонтр.Номенклатура
	|ГДЕ
	|	НЕ НомКонтр.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ЗагружаемыйТовар КАК ЗагружаемыйТовар,
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	НомКонт.КодКлиента КАК КодКлиента,
	|	НомКонт.АртикулКлиента КАК АртикулКлиента,
	|	НомКонт.НоменклатураКлиента КАК НоменклатураКлиента
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомКонт КАК НомКонт
	|		ПО вт.Номенклатура = НомКонт.Номенклатура";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Функция ПолучитьНайденныеТовары()
	Отказ       = Ложь;
	МассивСтрок = Новый Массив;
	НомерСтроки = 0;
	
	Для каждого Стр Из Товары Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьПользователю("По данным для поиска в строке " + НомерСтроки + " совпадений не найдено.",,,,Отказ);
		КонецЕсли;
			
		Если Стр.Количество = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке " + НомерСтроки + " не указано количество.",,,,Отказ);
		КонецЕсли; 
		
		Если Стр.КоличествоУпаковок - Цел(Стр.КоличествоУпаковок) > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке " + НомерСтроки + " не указано не целое количество упаковок.",,,,Отказ);
		КонецЕсли; 

		НовСтр = Новый Структура("Номенклатура, Количество");
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.Количество   = Стр.Количество;
		
		МассивСтрок.Добавить(НовСтр);
	КонецЦикла; 

	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		Возврат МассивСтрок;
	КонецЕсли;
КонецФункции

#КонецОбласти
